#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```      + registration_flow                        = (known after apply)
      + remember_me                              = (known after apply)
      + reset_credentials_flow                   = (known after apply)
      + reset_password_allowed                   = (known after apply)
      + revoke_refresh_token                     = false
      + ssl_required                             = "external"
      + sso_session_idle_timeout                 = (known after apply)
      + sso_session_idle_timeout_remember_me     = (known after apply)
      + sso_session_max_lifespan                 = (known after apply)
      + sso_session_max_lifespan_remember_me     = (known after apply)
      + user_managed_access                      = false
      + verify_email                             = (known after apply)

      + otp_policy {
          + algorithm         = (known after apply)
          + digits            = (known after apply)
          + initial_counter   = (known after apply)
          + look_ahead_window = (known after apply)
          + period            = (known after apply)
          + type              = (known after apply)
        }

      + web_authn_passwordless_policy {
          + acceptable_aaguids                = (known after apply)
          + attestation_conveyance_preference = (known after apply)
          + authenticator_attachment          = (known after apply)
          + avoid_same_authenticator_register = (known after apply)
          + create_timeout                    = (known after apply)
          + relying_party_entity_name         = (known after apply)
          + relying_party_id                  = (known after apply)
          + require_resident_key              = (known after apply)
          + signature_algorithms              = (known after apply)
          + user_verification_requirement     = (known after apply)
        }

      + web_authn_policy {
          + acceptable_aaguids                = (known after apply)
          + attestation_conveyance_preference = (known after apply)
          + authenticator_attachment          = (known after apply)
          + avoid_same_authenticator_register = (known after apply)
          + create_timeout                    = (known after apply)
          + relying_party_entity_name         = (known after apply)
          + relying_party_id                  = (known after apply)
          + require_resident_key              = (known after apply)
          + signature_algorithms              = (known after apply)
          + user_verification_requirement     = (known after apply)
        }
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.keycloak_realm.this will be destroyed
  # (because keycloak_realm.this is not in configuration)
  - resource "keycloak_realm" "this" {
      - access_code_lifespan                     = "1m0s" -> null
      - access_code_lifespan_login               = "30m0s" -> null
      - access_code_lifespan_user_action         = "5m0s" -> null
      - access_token_lifespan                    = "5m0s" -> null
      - access_token_lifespan_for_implicit_flow  = "15m0s" -> null
      - action_token_generated_by_admin_lifespan = "12h0m0s" -> null
      - action_token_generated_by_user_lifespan  = "5m0s" -> null
      - attributes                               = {} -> null
      - browser_flow                             = "browser" -> null
      - client_authentication_flow               = "clients" -> null
      - client_session_idle_timeout              = "0s" -> null
      - client_session_max_lifespan              = "0s" -> null
      - default_default_client_scopes            = [] -> null
      - default_optional_client_scopes           = [] -> null
      - direct_grant_flow                        = "direct grant" -> null
      - docker_authentication_flow               = "docker auth" -> null
      - duplicate_emails_allowed                 = false -> null
      - edit_username_allowed                    = false -> null
      - enabled                                  = true -> null
      - id                                       = "zorin-dev-custom-realm" -> null
      - internal_id                              = "zorin-dev-custom-realm" -> null
      - login_with_email_allowed                 = false -> null
      - oauth2_device_code_lifespan              = "10m0s" -> null
      - oauth2_device_polling_interval           = 5 -> null
      - offline_session_idle_timeout             = "720h0m0s" -> null
      - offline_session_max_lifespan             = "1440h0m0s" -> null
      - offline_session_max_lifespan_enabled     = false -> null
      - realm                                    = "zorin-dev-custom-realm" -> null
      - refresh_token_max_reuse                  = 0 -> null
      - registration_allowed                     = false -> null
      - registration_email_as_username           = false -> null
      - registration_flow                        = "registration" -> null
      - remember_me                              = false -> null
      - reset_credentials_flow                   = "reset credentials" -> null
      - reset_password_allowed                   = false -> null
      - revoke_refresh_token                     = false -> null
      - ssl_required                             = "external" -> null
      - sso_session_idle_timeout                 = "30m0s" -> null
      - sso_session_idle_timeout_remember_me     = "0s" -> null
      - sso_session_max_lifespan                 = "10h0m0s" -> null
      - sso_session_max_lifespan_remember_me     = "0s" -> null
      - user_managed_access                      = false -> null
      - verify_email                             = false -> null

      - otp_policy {
          - algorithm         = "HmacSHA1" -> null
          - digits            = 6 -> null
          - initial_counter   = 0 -> null
          - look_ahead_window = 1 -> null
          - period            = 30 -> null
          - type              = "totp" -> null
        }

      - web_authn_passwordless_policy {
          - acceptable_aaguids                = [] -> null
          - attestation_conveyance_preference = "not specified" -> null
          - authenticator_attachment          = "not specified" -> null
          - avoid_same_authenticator_register = false -> null
          - create_timeout                    = 0 -> null
          - relying_party_entity_name         = "keycloak" -> null
          - require_resident_key              = "not specified" -> null
          - signature_algorithms              = [
              - "ES256",
            ] -> null
          - user_verification_requirement     = "not specified" -> null
        }

      - web_authn_policy {
          - acceptable_aaguids                = [] -> null
          - attestation_conveyance_preference = "not specified" -> null
          - authenticator_attachment          = "not specified" -> null
          - avoid_same_authenticator_register = false -> null
          - create_timeout                    = 0 -> null
          - relying_party_entity_name         = "keycloak" -> null
          - require_resident_key              = "not specified" -> null
          - signature_algorithms              = [
              - "ES256",
            ] -> null
          - user_verification_requirement     = "not specified" -> null
        }
    }

  # module.keycloak_dev.module.custom_realms.module.sso-team-testing.module.realm_admin_master.data.keycloak_openid_client.realm_management will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "realm_management"  {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "sso-team-testing-realm"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = "master"
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.sso-team-testing.module.realm_admin_master.data.keycloak_role.target_roles["create-client"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "create-client"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.sso-team-testing.module.realm_admin_master.data.keycloak_role.target_roles["impersonation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "impersonation"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.sso-team-testing.module.realm_admin_master.data.keycloak_role.target_roles["manage-authorization"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "manage-authorization"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.sso-team-testing.module.realm_admin_master.data.keycloak_role.target_roles["manage-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "manage-clients"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.sso-team-testing.module.realm_admin_master.data.keycloak_role.target_roles["manage-events"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "manage-events"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.sso-team-testing.module.realm_admin_master.data.keycloak_role.target_roles["manage-identity-providers"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "manage-identity-providers"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.sso-team-testing.module.realm_admin_master.data.keycloak_role.target_roles["manage-realm"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "manage-realm"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.sso-team-testing.module.realm_admin_master.data.keycloak_role.target_roles["manage-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "manage-users"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.sso-team-testing.module.realm_admin_master.data.keycloak_role.target_roles["query-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "query-clients"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.sso-team-testing.module.realm_admin_master.data.keycloak_role.target_roles["query-groups"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "query-groups"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.sso-team-testing.module.realm_admin_master.data.keycloak_role.target_roles["query-realms"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "query-realms"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.sso-team-testing.module.realm_admin_master.data.keycloak_role.target_roles["query-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "query-users"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.sso-team-testing.module.realm_admin_master.data.keycloak_role.target_roles["view-authorization"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.sso-team-testing.module.realm_admin_master.data.keycloak_role.target_roles["view-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.sso-team-testing.module.realm_admin_master.data.keycloak_role.target_roles["view-events"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.sso-team-testing.module.realm_admin_master.data.keycloak_role.target_roles["view-identity-providers"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.sso-team-testing.module.realm_admin_master.data.keycloak_role.target_roles["view-realm"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.sso-team-testing.module.realm_admin_master.data.keycloak_role.target_roles["view-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.sso-team-testing.module.realm_admin_master.keycloak_group.group will be created
  + resource "keycloak_group" "group" {
      + id       = (known after apply)
      + name     = "sso-team-testing Realm Administrator"
      + path     = (known after apply)
      + realm_id = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.sso-team-testing.module.realm_admin_master.keycloak_group_roles.role_group_binding will be created
  + resource "keycloak_group_roles" "role_group_binding" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = "master"
      + role_ids   = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.sso-team-testing.module.realm_admin_master.keycloak_openid_client.service_account will be created
  + resource "keycloak_openid_client" "service_account" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "sso-team-testing-realm-admin-cli"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "sso-team-testing-realm-admin-cli"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "master"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.keycloak_dev.module.custom_realms.module.sso-team-testing.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be created
  + resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      + id                      = (known after apply)
      + realm_id                = "master"
      + role                    = "sso-team-testing-realm-admin"
      + service_account_user_id = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.sso-team-testing.module.realm_admin_master.keycloak_role.role will be created
  + resource "keycloak_role" "role" {
      + composite_roles = (known after apply)
      + id              = (known after apply)
      + name            = "sso-team-testing-realm-admin"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_admin_master.keycloak_group.group will be destroyed
  # (because keycloak_group.group is not in configuration)
  - resource "keycloak_group" "group" {
      - attributes = {} -> null
      - id         = "2957a6d0-c098-444b-93da-76f26f20b9a9" -> null
      - name       = "zorin-dev-custom-realm Realm Administrator" -> null
      - path       = "/zorin-dev-custom-realm Realm Administrator" -> null
      - realm_id   = "master" -> null
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_admin_master.keycloak_group_roles.role_group_binding will be destroyed
  # (because keycloak_group_roles.role_group_binding is not in configuration)
  - resource "keycloak_group_roles" "role_group_binding" {
      - exhaustive = true -> null
      - group_id   = "2957a6d0-c098-444b-93da-76f26f20b9a9" -> null
      - id         = "master/2957a6d0-c098-444b-93da-76f26f20b9a9" -> null
      - realm_id   = "master" -> null
      - role_ids   = [
          - "abe4b627-40d1-4055-98da-609ea09166da",
        ] -> null
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_admin_master.keycloak_openid_client.service_account will be destroyed
  # (because keycloak_openid_client.service_account is not in configuration)
  - resource "keycloak_openid_client" "service_account" {
      - access_type                                = "CONFIDENTIAL" -> null
      - backchannel_logout_revoke_offline_sessions = false -> null
      - backchannel_logout_session_required        = true -> null
      - client_authenticator_type                  = "client-secret" -> null
      - client_id                                  = "zorin-dev-custom-realm-realm-admin-cli" -> null
      - client_secret                              = (sensitive value)
      - consent_required                           = false -> null
      - direct_access_grants_enabled               = false -> null
      - display_on_consent_screen                  = false -> null
      - enabled                                    = true -> null
      - exclude_session_state_from_auth_response   = false -> null
      - extra_config                               = {} -> null
      - frontchannel_logout_enabled                = false -> null
      - full_scope_allowed                         = true -> null
      - id                                         = "2134adb6-1011-415d-81af-95b6d2a8445e" -> null
      - implicit_flow_enabled                      = false -> null
      - name                                       = "zorin-dev-custom-realm-realm-admin-cli" -> null
      - oauth2_device_authorization_grant_enabled  = false -> null
      - realm_id                                   = "master" -> null
      - service_account_user_id                    = "0b0c571a-e7ec-4905-b97d-be1e8eb7e379" -> null
      - service_accounts_enabled                   = true -> null
      - standard_flow_enabled                      = false -> null
      - use_refresh_tokens                         = true -> null
      - use_refresh_tokens_client_credentials      = false -> null
      - valid_redirect_uris                        = [] -> null
      - web_origins                                = [] -> null
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be destroyed
  # (because keycloak_openid_client_service_account_realm_role.role_service_account_binding is not in configuration)
  - resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      - id                      = "0b0c571a-e7ec-4905-b97d-be1e8eb7e379/abe4b627-40d1-4055-98da-609ea09166da" -> null
      - realm_id                = "master" -> null
      - role                    = "zorin-dev-custom-realm-realm-admin" -> null
      - service_account_user_id = "0b0c571a-e7ec-4905-b97d-be1e8eb7e379" -> null
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_admin_master.keycloak_role.role will be destroyed
  # (because keycloak_role.role is not in configuration)
  - resource "keycloak_role" "role" {
      - attributes      = {} -> null
      - composite_roles = [
          - "13866b87-a8ad-49c9-a70f-a50ba2b2cae3",
          - "2aba6b2f-8c02-43e1-bef8-605051fd7ff3",
          - "43e84942-edf2-4c7d-8a16-e02ddad4efd6",
          - "79728f49-d818-4390-8d99-e2012cd0e06d",
          - "90ee83bd-7f23-4211-a59b-e4d9aab0c80a",
          - "9da5c2fc-1fe1-4d7a-a67e-e6641f32b0b9",
          - "a2aac2c5-75cd-4e9b-b2d5-47e1cdb76557",
          - "a9d4b94f-0e68-4fc9-97c0-0aa0a9a99ef9",
          - "bcda8a26-5ea7-4f69-97d9-0f670ae61954",
          - "c6f814d8-72a4-44a7-99ba-7e665269ddbc",
          - "d2f42e41-ce2b-40e4-be56-cbeca0daecca",
          - "da6b64eb-be4a-4b8e-8ba7-e5e00e24ca0c",
          - "dc82719b-eb74-4afe-8b6c-bf12565b062d",
          - "e528a719-f71c-4957-a7c9-428e4ccef693",
          - "eeb28453-5aca-4385-ba52-4c1d40301510",
          - "f692e3a1-37f7-4fb1-ab65-8682e80dba28",
          - "f85ce5ee-a882-4952-9624-1a9129aaebb3",
          - "fcc9361b-46e6-4b10-8426-8c8e883e6104",
        ] -> null
      - id              = "abe4b627-40d1-4055-98da-609ea09166da" -> null
      - name            = "zorin-dev-custom-realm-realm-admin" -> null
      - realm_id        = "master" -> null
    }

  # module.keycloak_dev.module.custom_realms.module.sso-team-testing.module.realm_admin.module.realm_admin.data.keycloak_openid_client.realm_management will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "realm_management"  {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "realm-management"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.sso-team-testing.module.realm_admin.module.realm_admin.data.keycloak_role.target_roles["realm-admin"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "realm-admin"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.sso-team-testing.module.realm_admin.module.realm_admin.keycloak_group.group will be created
  + resource "keycloak_group" "group" {
      + id       = (known after apply)
      + name     = "Realm Administrator"
      + path     = (known after apply)
      + realm_id = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.sso-team-testing.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding will be created
  + resource "keycloak_group_roles" "role_group_binding" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.sso-team-testing.module.realm_admin.module.realm_admin.keycloak_openid_client.service_account will be created
  + resource "keycloak_openid_client" "service_account" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "realm-admin-cli"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "realm-admin-cli"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = (known after apply)
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.keycloak_dev.module.custom_realms.module.sso-team-testing.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be created
  + resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      + id                      = (known after apply)
      + realm_id                = (known after apply)
      + role                    = "realm-admin"
      + service_account_user_id = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.sso-team-testing.module.realm_admin.module.realm_admin.keycloak_role.role will be created
  + resource "keycloak_role" "role" {
      + composite_roles = (known after apply)
      + id              = (known after apply)
      + name            = "realm-admin"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.sso-team-testing.module.realm_viewer.module.realm_viewer.data.keycloak_openid_client.realm_management will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "realm_management"  {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "realm-management"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.sso-team-testing.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-authorization"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.sso-team-testing.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.sso-team-testing.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-events"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.sso-team-testing.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-identity-providers"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.sso-team-testing.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-realm"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.sso-team-testing.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.sso-team-testing.module.realm_viewer.module.realm_viewer.keycloak_group.group will be created
  + resource "keycloak_group" "group" {
      + id       = (known after apply)
      + name     = "Realm Viewer"
      + path     = (known after apply)
      + realm_id = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.sso-team-testing.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding will be created
  + resource "keycloak_group_roles" "role_group_binding" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.sso-team-testing.module.realm_viewer.module.realm_viewer.keycloak_openid_client.service_account will be created
  + resource "keycloak_openid_client" "service_account" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "realm-viewer-cli"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "realm-viewer-cli"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = (known after apply)
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.keycloak_dev.module.custom_realms.module.sso-team-testing.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be created
  + resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      + id                      = (known after apply)
      + realm_id                = (known after apply)
      + role                    = "realm-viewer"
      + service_account_user_id = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.sso-team-testing.module.realm_viewer.module.realm_viewer.keycloak_role.role will be created
  + resource "keycloak_role" "role" {
      + composite_roles = (known after apply)
      + id              = (known after apply)
      + name            = "realm-viewer"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_admin.module.realm_admin.keycloak_group.group will be destroyed
  # (because keycloak_group.group is not in configuration)
  - resource "keycloak_group" "group" {
      - attributes = {} -> null
      - id         = "011bbb33-0c73-4640-bb77-2764a76d68c4" -> null
      - name       = "Realm Administrator" -> null
      - path       = "/Realm Administrator" -> null
      - realm_id   = "zorin-dev-custom-realm" -> null
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding will be destroyed
  # (because keycloak_group_roles.role_group_binding is not in configuration)
  - resource "keycloak_group_roles" "role_group_binding" {
      - exhaustive = true -> null
      - group_id   = "011bbb33-0c73-4640-bb77-2764a76d68c4" -> null
      - id         = "zorin-dev-custom-realm/011bbb33-0c73-4640-bb77-2764a76d68c4" -> null
      - realm_id   = "zorin-dev-custom-realm" -> null
      - role_ids   = [
          - "2b1a10e9-0a36-47af-affe-8385e15a7844",
        ] -> null
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_admin.module.realm_admin.keycloak_openid_client.service_account will be destroyed
  # (because keycloak_openid_client.service_account is not in configuration)
  - resource "keycloak_openid_client" "service_account" {
      - access_type                                = "CONFIDENTIAL" -> null
      - backchannel_logout_revoke_offline_sessions = false -> null
      - backchannel_logout_session_required        = true -> null
      - client_authenticator_type                  = "client-secret" -> null
      - client_id                                  = "realm-admin-cli" -> null
      - client_secret                              = (sensitive value)
      - consent_required                           = false -> null
      - direct_access_grants_enabled               = false -> null
      - display_on_consent_screen                  = false -> null
      - enabled                                    = true -> null
      - exclude_session_state_from_auth_response   = false -> null
      - extra_config                               = {} -> null
      - frontchannel_logout_enabled                = false -> null
      - full_scope_allowed                         = true -> null
      - id                                         = "2c501d31-ae7c-4bc2-97ef-bd59b94fe30a" -> null
      - implicit_flow_enabled                      = false -> null
      - name                                       = "realm-admin-cli" -> null
      - oauth2_device_authorization_grant_enabled  = false -> null
      - realm_id                                   = "zorin-dev-custom-realm" -> null
      - service_account_user_id                    = "b7f6a9d7-41bb-4709-b55a-ff6d150b9c36" -> null
      - service_accounts_enabled                   = true -> null
      - standard_flow_enabled                      = false -> null
      - use_refresh_tokens                         = true -> null
      - use_refresh_tokens_client_credentials      = false -> null
      - valid_redirect_uris                        = [] -> null
      - web_origins                                = [] -> null
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be destroyed
  # (because keycloak_openid_client_service_account_realm_role.role_service_account_binding is not in configuration)
  - resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      - id                      = "b7f6a9d7-41bb-4709-b55a-ff6d150b9c36/2b1a10e9-0a36-47af-affe-8385e15a7844" -> null
      - realm_id                = "zorin-dev-custom-realm" -> null
      - role                    = "realm-admin" -> null
      - service_account_user_id = "b7f6a9d7-41bb-4709-b55a-ff6d150b9c36" -> null
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_admin.module.realm_admin.keycloak_role.role will be destroyed
  # (because keycloak_role.role is not in configuration)
  - resource "keycloak_role" "role" {
      - attributes      = {} -> null
      - composite_roles = [
          - "77c12978-aa88-42c8-a203-4d3acde5e054",
        ] -> null
      - id              = "2b1a10e9-0a36-47af-affe-8385e15a7844" -> null
      - name            = "realm-admin" -> null
      - realm_id        = "zorin-dev-custom-realm" -> null
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_viewer.module.realm_viewer.keycloak_group.group will be destroyed
  # (because keycloak_group.group is not in configuration)
  - resource "keycloak_group" "group" {
      - attributes = {} -> null
      - id         = "e7a8d314-bd38-404a-9ea2-a156c077cd57" -> null
      - name       = "Realm Viewer" -> null
      - path       = "/Realm Viewer" -> null
      - realm_id   = "zorin-dev-custom-realm" -> null
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding will be destroyed
  # (because keycloak_group_roles.role_group_binding is not in configuration)
  - resource "keycloak_group_roles" "role_group_binding" {
      - exhaustive = true -> null
      - group_id   = "e7a8d314-bd38-404a-9ea2-a156c077cd57" -> null
      - id         = "zorin-dev-custom-realm/e7a8d314-bd38-404a-9ea2-a156c077cd57" -> null
      - realm_id   = "zorin-dev-custom-realm" -> null
      - role_ids   = [
          - "1b773ff7-5535-47ce-a025-0d335016a584",
        ] -> null
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_viewer.module.realm_viewer.keycloak_openid_client.service_account will be destroyed
  # (because keycloak_openid_client.service_account is not in configuration)
  - resource "keycloak_openid_client" "service_account" {
      - access_type                                = "CONFIDENTIAL" -> null
      - backchannel_logout_revoke_offline_sessions = false -> null
      - backchannel_logout_session_required        = true -> null
      - client_authenticator_type                  = "client-secret" -> null
      - client_id                                  = "realm-viewer-cli" -> null
      - client_secret                              = (sensitive value)
      - consent_required                           = false -> null
      - direct_access_grants_enabled               = false -> null
      - display_on_consent_screen                  = false -> null
      - enabled                                    = true -> null
      - exclude_session_state_from_auth_response   = false -> null
      - extra_config                               = {} -> null
      - frontchannel_logout_enabled                = false -> null
      - full_scope_allowed                         = true -> null
      - id                                         = "5cea1d6c-a6ea-4dd7-83c5-603fe030cd01" -> null
      - implicit_flow_enabled                      = false -> null
      - name                                       = "realm-viewer-cli" -> null
      - oauth2_device_authorization_grant_enabled  = false -> null
      - realm_id                                   = "zorin-dev-custom-realm" -> null
      - service_account_user_id                    = "128074ff-531e-4e03-b146-fd791a836acf" -> null
      - service_accounts_enabled                   = true -> null
      - standard_flow_enabled                      = false -> null
      - use_refresh_tokens                         = true -> null
      - use_refresh_tokens_client_credentials      = false -> null
      - valid_redirect_uris                        = [] -> null
      - web_origins                                = [] -> null
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be destroyed
  # (because keycloak_openid_client_service_account_realm_role.role_service_account_binding is not in configuration)
  - resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      - id                      = "128074ff-531e-4e03-b146-fd791a836acf/1b773ff7-5535-47ce-a025-0d335016a584" -> null
      - realm_id                = "zorin-dev-custom-realm" -> null
      - role                    = "realm-viewer" -> null
      - service_account_user_id = "128074ff-531e-4e03-b146-fd791a836acf" -> null
    }

  # module.keycloak_dev.module.custom_realms.module.zorin-dev-custom-realm.module.realm_viewer.module.realm_viewer.keycloak_role.role will be destroyed
  # (because keycloak_role.role is not in configuration)
  - resource "keycloak_role" "role" {
      - attributes      = {} -> null
      - composite_roles = [
          - "23017559-a0e0-44d0-b3c0-c0f528c85c1d",
          - "4867bf37-b337-4721-9217-b4a9bb6937dc",
          - "7208fa65-f283-4bcb-8c58-c7720ec7ba3d",
          - "b70513c2-fab6-4b9a-9794-70e3897660f9",
          - "f3ca7125-a68b-4675-8acf-1e84ed94f648",
          - "ffc1f6a7-6b57-42c3-b1b7-4dab32a88799",
        ] -> null
      - id              = "1b773ff7-5535-47ce-a025-0d335016a584" -> null
      - name            = "realm-viewer" -> null
      - realm_id        = "zorin-dev-custom-realm" -> null
    }

Plan: 16 to add, 0 to change, 16 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.```

</details>

*Pusher: @arcshiftsolutions, Action: `pull_request`*